Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/FastLED_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: [Core Concepts](../core-concepts/) - Color theory, timing, and power management
it_it: [Concetti Fondamentali](../core-concepts/README) - Teoria del colore, tempistica e gestione dell'alimentazione

source: [Core Concepts](../core-concepts/) - Deeper dive into LED programming
it_it: [Concetti Fondamentali](../core-concepts/README) - Approfondimento sulla programmazione LED

source: [Core Concepts](../core-concepts/) - Especially arrays and timing
it_it: [Concetti Fondamentali](../core-concepts/README) - In particolare array e temporizzazione

source: [Core Concepts](../core-concepts/) - Especially arrays, color theory, and timing
it_it: [Concetti Fondamentali](../core-concepts/README) - In particolare array, teoria dei colori e timing

source: [Core Concepts](../core-concepts/) - Especially timing and memory considerations
it_it: [Concetti Fondamentali](../core-concepts/README) - In particolare considerazioni su tempi e memoria

source: [Core Concepts](../core-concepts/) - Learn about data structures and timing
it_it: [Concetti fondamentali](../core-concepts/README) - Scoprire le strutture dati e la temporizzazione

source: [Core Concepts](../core-concepts/) - Understanding color theory, arrays, and timing
it_it: [Concetti Fondamentali](../core-concepts/README) - Comprensione della teoria dei colori, degli array e del timing

source: [Core Concepts](core-concepts/)
it_it: {doc}`Concetti Fondamentali <core-concepts/README>`

source: [Debugging Tips](debugging.md)
it_it: [Suggerimenti per il Debug](debugging)

source: [Debugging Tips](debugging.md) - Diagnostic code and techniques
it_it: [Suggerimenti per il Debug](debugging) - Codice e tecniche di diagnostica

source: [Debugging Tips](debugging.md) - Software debugging techniques
it_it: [Suggerimenti per il Debug](debugging) - Tecniche di debug del software

source: [Debugging Tips](troubleshooting/debugging.md)
it_it: [Suggerimenti per il debug](troubleshooting/debugging)

source: [FastLED Concepts](concepts.md) - Understanding of basic LED control concepts
it_it: [Concetti FastLED](concepts) - Comprensione dei concetti base del controllo LED

source: [Fire Effect](recipes/fire.md)
it_it: [Effetto Fiamma](recipes/fire)

source: [First Example](../getting-started/first-example.md) - Basic LED programming experience
it_it: [Primo Esempio](../getting-started/first-example) - Esperienza di programmazione LED di base

source: [Getting Started - Basic Concepts](../getting-started/concepts.md)
it_it: [Guida Introduttiva - Concetti di Base](../getting-started/concepts)

source: [Getting Started - First Example](../getting-started/first-example.md)
it_it: [Introduzione - Primo Esempio](../getting-started/first-example)

source: [Getting Started - Hardware Requirements](../COOKBOOK.md#hardware-requirements) - Initial setup
it_it: [Introduzione: Requisiti Hardware](../README) - Configurazione iniziale

source: [Getting Started - Hardware Requirements](../getting-started/hardware.md)
it_it: [Introduzione - Requisiti hardware](../getting-started/hardware)

source: [Getting Started - Hardware Setup](../getting-started/hardware.md)
it_it: [Guida Introduttiva - Configurazione Hardware](../getting-started/hardware)

source: [Getting Started: Basic Concepts](../getting-started/concepts.md) - Understanding FastLED fundamentals
it_it: [Introduzione: Concetti di Base](../getting-started/concepts) - Comprensione dei fondamenti di FastLED

source: [Getting Started: First Example](../getting-started/first-example.md) - Basic FastLED setup
it_it: [Introduzione: Primo Esempio](../getting-started/first-example) - Configurazione base di FastLED

source: [Getting Started: First Example](../getting-started/first-example.md) - Basic FastLED setup and code structure
it_it: [Introduzione: Primo Esempio](../getting-started/first-example) - Configurazione di base di FastLED e struttura del codice

source: [Getting Started: First Example](../getting-started/first-example.md) - Hands-on programming experience
it_it: [Introduzione: Primo Esempio](../getting-started/first-example) - Esperienza pratica di programmazione

source: [Getting Started: Hardware](../getting-started/hardware.md) - Hardware wiring basics
it_it: [Introduzione: Hardware](../getting-started/hardware) - Nozioni di base sul cablaggio hardware

source: [Getting Started: Hardware](../getting-started/hardware.md) - Understanding of wiring and components
it_it: [Introduzione: Hardware](../getting-started/hardware) - Comprensione del cablaggio e dei componenti

source: [Getting Started](../COOKBOOK.md#getting-started) - Initial setup and basics
it_it: [Guida Introduttiva](../README) - Configurazione iniziale e nozioni di base

source: [Getting Started](../getting-started/) - Basic LED control and FastLED setup
it_it: [Guida Introduttiva](../getting-started/README) - Controllo LED di base e configurazione FastLED

source: [Getting Started](getting-started/)
it_it: [Per Iniziare](getting-started/README)

source: [Hardware Problems](hardware.md)
it_it: [Problemi Hardware](hardware)

source: [Hardware Problems](hardware.md) - Hardware-specific troubleshooting
it_it: [Problemi Hardware](hardware) - Risoluzione dei problemi specifici dell'hardware

source: [Hardware Problems](hardware.md) - In-depth hardware troubleshooting
it_it: [Problemi Hardware](hardware) - Risoluzione approfondita dei problemi hardware

source: [Hardware Problems](troubleshooting/hardware.md)
it_it: [Problemi Hardware](troubleshooting/hardware)

source: [Hardware Requirements](getting-started/hardware.md)
it_it: {doc}`Requisiti Hardware <getting-started/hardware>`

source: [Hardware Requirements](hardware.md) - Gather the components you need
it_it: [Requisiti hardware](hardware) - Raccogliere i componenti necessari

source: [Hardware Requirements](hardware.md) - What components you need
it_it: [Requisiti Hardware](hardware) - Quali componenti servono

source: [Installation and Setup](getting-started/installation.md)
it_it: {doc}`Installazione e Configurazione <getting-started/installation>`

source: [Installation and Setup](installation.md) - How to install FastLED for your platform
it_it: [Installazione e Configurazione](installation) - Come installare FastLED per la piattaforma

source: [Installation and Setup](installation.md) - Set up your development environment
it_it: [Installazione e Configurazione](installation) - Configurare l'ambiente di sviluppo

source: [Intermediate Techniques](../intermediate/) - Advanced color manipulation
it_it: [Tecniche Intermedie](../intermediate/README) - Manipolazione avanzata del colore

source: [Intermediate Techniques](../intermediate/) - Advanced patterns that benefit from optimization
it_it: [Tecniche Intermedie](../intermediate/README) - Pattern avanzati che traggono vantaggio dall'ottimizzazione

source: [Intermediate Techniques](../intermediate/) - Math utilities and coordination patterns
it_it: [Tecniche Intermedie](../intermediate/README) - Utilità matematiche e pattern di coordinamento

source: [Intermediate Techniques](../intermediate/) - Noise functions, palettes, and math utilities
it_it: [Tecniche Intermedie](../intermediate/README) - Funzioni di rumore, palette e utilità matematiche

source: [Intermediate Techniques](../intermediate/) - Palettes, noise functions, blending, and math utilities
it_it: [Tecniche Intermedie](../intermediate/README) - Palette, funzioni di rumore, fusione e utilità matematiche

source: [Intermediate Techniques](intermediate/)
it_it: {doc}`Tecniche Intermedie <intermediate/README>`

source: [Intermediate: Blending](../intermediate/blending.md) - fadeToBlackBy() for brightness control
it_it: [Intermedio: Fusione](../intermediate/blending) - fadeToBlackBy() per il controllo della luminosità

source: [Intermediate: Blending](../intermediate/blending.md) - fadeToBlackBy() for trail effects
it_it: [Intermedio: Fusione](../intermediate/blending) - fadeToBlackBy() per effetti scia

source: [Intermediate: Math](../intermediate/math.md) - beatsin8() and wave functions
it_it: [Intermedio: Matematica](../intermediate/math) - beatsin8() e funzioni d'onda

source: [Intermediate: Math](../intermediate/math.md) - sin8(), beatsin8(), and trigonometric wave functions (core dependency)
it_it: [Intermedio: Matematica](../intermediate/math) - sin8(), beatsin8() e funzioni d'onda trigonometriche (dipendenza dal core)

source: [LED Types](led-types.md)
it_it: [Tipi di LED](led-types)

source: [LED Types](led-types.md) - Supported LED chipsets and configuration
it_it: [Tipi di LED](led-types) - Chipset LED supportati e relative configurazioni

source: [Main Cookbook](../COOKBOOK.md) - Complete FastLED guide
it_it: [Ricettario Principale](../README) - Guida completa a FastLED

source: [Main Cookbook](../COOKBOOK.md) - Full FastLED guide
it_it: [Guida Principale](../README) - Guida completa a FastLED

source: [Math Functions](../intermediate/math.md) - Using scale8(), qadd8(), qsub8() for calculations
it_it: [Funzioni Matematiche](../intermediate/math) - Utilizzo di scale8(), qadd8(), qsub8() per i calcoli

source: [Math Functions](../intermediate/math.md) - random8() and random16() functions
it_it: [Funzioni Matematiche](../intermediate/math) - Funzioni random8() e random16()

source: [Math and Mapping Functions](intermediate/math.md)
it_it: {doc}`Funzioni Matematiche e di Mappatura <intermediate/math>`

source: [Math and Mapping Functions](math.md)
it_it: [Funzioni Matematiche e di Mappatura](math)

source: [Math and Mapping Functions](math.md) - Combine noise with mathematical functions
it_it: [Funzioni Matematiche e di Mappatura](math) - Combina il rumore con funzioni matematiche

source: [Math and Mapping Functions](math.md) - Use mathematical functions for precise control
it_it: [Funzioni Matematiche e di Mappatura](math) - Utilizzare funzioni matematiche per un controllo preciso

source: [Multiple Strip Coordination](advanced/multi-strip.md)
it_it: [Coordinamento di più Strisce](advanced/multi-strip)

source: [Multiple Strip Coordination](multi-strip.md) - Controlling and synchronizing multiple LED strips
it_it: [Coordinamento di più Strisce](multi-strip) - Controllo e sincronizzazione di più strisce LED

source: [Noise and Perlin Noise](../../COOKBOOK.md#noise-and-perlin-noise) - Organic animations
it_it: [Rumore e Rumore di Perlin](../intermediate/noise) - Animazioni organiche

source: [Noise and Perlin Noise](intermediate/noise.md)
it_it: {doc}`Rumore e Rumore di Perlin <intermediate/noise>`

source: [Noise and Perlin Noise](noise.md)
it_it: [Rumore e Rumore di Perlin](noise)

source: [Noise and Perlin Noise](noise.md) - Combine with noise for organic effects
it_it: [Rumore e Rumore di Perlin](noise) - Combinare con il rumore per effetti organici

source: [Noise and Perlin Noise](noise.md) - Use noise to control blend amounts
it_it: [Rumore e Rumore di Perlin](noise) - Usare il rumore per controllare la quantità di fusione

source: [Noise and Perlin Noise](noise.md) - Use palettes with noise for organic effects
it_it: [Rumore e Rumore Perlin](noise) - Usare palette con rumore per effetti organici

source: [Palettes](../intermediate/palettes.md) - Understanding ColorFromPalette() and built-in palettes
it_it: [Palette](../intermediate/palettes) - Comprensione di ColorFromPalette() e delle palette native

source: [Performance Optimization](advanced/optimization.md)
it_it: [Ottimizzazione delle Prestazioni](advanced/optimization)

source: [Performance Optimization](optimization.md) - Tips and techniques for smooth, efficient animations
it_it: [Ottimizzazione delle Prestazioni](optimization) - Suggerimenti e tecniche per animazioni fluide ed efficienti

source: [Pin Configurations by Platform](reference/pins.md)
it_it: [Configurazioni Pin per Piattaforma](reference/pins)

source: [Pin Configurations](pins.md)
it_it: [Configurazioni Pin](pins)

source: [Pin Configurations](pins.md) - Platform-specific pin recommendations
it_it: [Configurazioni dei Pin](pins) - Raccomandazioni pin specifiche per piattaforma

source: [Power Considerations](core-concepts/power.md)
it_it: {doc}`Considerazioni sulla Potenza <core-concepts/power>`

source: [Power Considerations](power.md) - Manage power consumption
it_it: [Considerazioni sul Consumo Energetico](power) - Gestione del consumo energetico

source: [Rainbow Effects](basic-patterns/rainbow.md)
it_it: {doc}`Effetti Arcobaleno <basic-patterns/rainbow>`

source: [Rainbow](rainbow.md) - Rainbow and color cycling effects
it_it: [Arcobaleno](rainbow) - Effetti arcobaleno e ciclo di colori

source: [Reference](../COOKBOOK.md#reference) - API and platform configurations
it_it: [Riferimento](../README) - Configurazioni API e piattaforma

source: [Reference](reference/)
it_it: [Riferimento](reference/README)

source: [Simple Animations](basic-patterns/animations.md)
it_it: {doc}`Animazioni Semplici <basic-patterns/animations>`

source: [Solid Colors](basic-patterns/solid-colors.md)
it_it: {doc}`Colori Pieni <basic-patterns/solid-colors>`

source: [Solid Colors](solid-colors.md) - Fill strips with single colors
it_it: [Colori Pieni](solid-colors) - Riempire strisce con colori singoli

source: [Solid Colors](solid-colors.md) - Understanding fill functions and color basics
it_it: [Colori Pieni](solid-colors) - Comprensione delle funzioni di riempimento e delle basi del colore

source: [Supported LED Types](reference/led-types.md)
it_it: [Tipi di LED Supportati](reference/led-types)

source: [Timing Control](../core-concepts/timing.md) - Frame rates and animation control
it_it: [Tempistiche e Frame Rate](../core-concepts/timing) - Frame rate e controllo delle animazioni

source: [Timing and Animation Control](../core-concepts/timing.md) - Frame rate and timing concepts
it_it: [Controllo del Tempo e dell'Animazione](../core-concepts/timing) - oncetti di frame rate e temporizzazione

source: [Timing and Frame Rate](core-concepts/timing.md)
it_it: {doc}`Temporizzazione e Frame Rate <core-concepts/timing>`

source: [Timing and Frame Rate](timing.md) - Control animation speed
it_it: [Temporizzazione e Frame Rate](timing) - Controllo della velocità di animazione

source: [Troubleshooting](../troubleshooting/hardware.md) - Fix power-related issues
it_it: [Risoluzione dei Problemi](../troubleshooting/hardware) - Risolvere i problemi relativi all'alimentazione

source: [Troubleshooting](troubleshooting/)
it_it: [Risoluzione dei Problemi](troubleshooting/README)

source: [Twinkle/Sparkle](recipes/twinkle.md)
it_it: [Luccichìo/Scintille](recipes/twinkle)

source: [Understanding LED Data Structures](core-concepts/led-structures.md)
it_it: {doc}`Comprendere le Strutture Dati dei LED <core-concepts/led-structures>`

source: [Understanding LED Data Structures](led-structures.md) - How LED arrays work
it_it: [Comprendere le Strutture Dati dei LED](led-structures) - Come funzionano le matrici di LED

source: [Wave Patterns](recipes/waves.md)
it_it: [Pattern a Onda](recipes/waves)

source: [Your First Blink Example](first-example.md) - Test your hardware
it_it: [Il tuo primo esempio di Blink](first-example) - Provare l'hardware

source: [Your First Blink Example](first-example.md) - Write and run your first LED program
it_it: [Il Primo Esempio di Lampeggìo](first-example) - Scrivere ed eseguire il primo programma LED

source: [Your First Blink Example](first-example.md) - Write your first program
it_it: [Il Primo Esempio di Lampeggìo](first-example) - Scrivere il primo programma

source: [Your First Blink Example](getting-started/first-example.md)
it_it: {doc}`Il Primo Esempio di Lampeggìo <getting-started/first-example>`

source: [← Back to Cookbook](../COOKBOOK.md)
it_it: [← Ritorno al Ricettario](../README)

source: [← Back to Reference](README.md)
it_it: [← Tornare al Riferimento](README)

source: _layouts: <=== Creates an explicit link target
it_it: _layouts: <=== Crea un link target esplicito

source: `0`: Starting hue (0-255)
it_it: `0`: Tonalità iniziale (0-255)

source: `255 / NUM_LEDS`: Hue increment per LED
it_it: `255 / NUM_LEDS`: Incremento di tonalità per LED

source: `255` = 100% (no change)
it_it: `255` = 100% (nessuna modifica)

source: `APA102` - DotStar (requires clock pin)
it_it: `APA102` - DotStar (richiede pin di clock)

source: `FastLED.addLeds<>()` - Tells FastLED about your hardware
it_it: `FastLED.addLeds<>()` - Fornisce informazioni a FastLED sull'hardware

source: `FastLED.setBrightness(50)` - Sets brightness to ~20% (safe for testing)
it_it: `FastLED.setBrightness(50)` - Imposta la luminosità a circa il 20% (sicuro per i test)

source: `FastLED.show()` being called in your code
it_it: `FastLED.show()` richiamato nel codice

source: `GRB` - WS2812B (most common)
it_it: `GRB` - WS2812B (il più comune)

source: `LINEARBLEND`: Smooth gradients (recommended)
it_it: `LINEARBLEND`: fumature uniformi (consigliato)

source: `NOBLEND`: Discrete color steps
it_it: `NOBLEND`: Passaggi di colore discreti

source: `NUM_LEDS`: Number of LEDs to fill
it_it: `NUM_LEDS`: Numero di LED da riempire

source: `RGB` - Some WS2811
it_it: `RGB` - Alcuni WS2811

source: `SK6812` - Similar to WS2812B
it_it: `SK6812` - Simile a WS2812B

source: `WS2812B` - Most common (NeoPixel)
it_it: `WS2812B` - Il più comune (NeoPixel)

source: `amount`: 0 = all color1, 255 = all color2, 128 = 50/50 mix
it_it: `amount`: 0 = tutto il colore 1, 255 = tutto il colore 2, 128 = miscela 50/50

source: `color1`: Starting color
it_it: `color1`: Colore iniziale

source: `color2`: Ending color
it_it: `color2`: Colore finale

source: `i * (255 / NUM_LEDS)` = smooth wave across strip
it_it: `i * (255 / NUM_LEDS)` = onda uniforme sulla striscia

source: `leds`: Your LED array
it_it: `leds`: La matrice LED

source: `loop()` runs repeatedly - update your LED colors here
it_it: `loop()` viene eseguito ripetutamente - aggiornare qui i colori dei LED

source: `millis()` overflows after ~49 days.
it_it: `millis()` va in overflow dopo circa 49 giorni.

source: `setup()` runs once at startup - configure your LEDs here
it_it: `setup()` viene eseguito una volta all'avvio - configurare qui i LED

source: a professional setting
it_it: un contesto professionale

source: and followed by 1 blank line.
it_it: e seguito da una riga vuota.

source: argument with > 1 word
it_it: argomento con > 1 parola

source: asterisk
it_it: asterisco

source: attacks
it_it: attacchi personali o politici

source: attention or advances
it_it: avances sessuali indesiderate

source: beatsin8() with Phase
it_it: beatsin8() con Fase

source: code-block:: is the only directive that should be used.
it_it: code-block:: è l'unica direttiva da utilizzare.

source: container:: tighter-table-N directive (N = digit 1-7 with 7 being the tightest), and indent your table to make it the "content" of the directive.
it_it: container:: tighter-table-N (N = cifre da 1 a 7, dove 7 è la più stretta) e indentarla per renderla "il contenuto" della direttiva.

source: electronic address, without explicit permission
it_it: elettronico, senza esplicita autorizzazione

source: include: /include/external_links.txt once at the top of each .rst file that uses it.
it_it: includere: /include/external_links.txt una volta all'inizio di ogni file .rst che lo utilizza.

source: index.rst Files
it_it: File index.rst

source: lines to align with item text like this.
it_it: righe successive per allinearle al testo dell'elemento, in questo modo.

source: list item, it must be intended to align with the list item like this:
it_it: voce di elenco, è necessario allinearli alla voce di elenco in questo modo:

source: lone ellipsis
it_it: singoli puntini di sospensione

source: millis() Overflow
it_it: Overflow di millis()

source: new level to align with its parent list item like this:
it_it: nuovo livello per allinearlo alla voce di elenco padre in questo modo:

source: overview
it_it: panoramica

source: overview <=== relative path to .rst files located in the same directory
it_it: panoramica <=== path relativo ai file .rst situati nella stessa directory

source: place 3 blank lines above the 2nd and subsequent "Section" titles (see above),
it_it: inserire 3 righe vuote sopra il secondo e i successivi titoli di "Sezione" (vedere sopra),

source: placeholder
it_it: segnaposto

source: qadd16() and qsub16()
it_it: qadd16() e qsub16()

source: random8() for Effects
it_it: random8() per gli Effetti

source: reStructuredText Content
it_it: Contenuto reStructuredText

source: reStructuredText syntax for creating tables can be found in the reST examples referred to above.
it_it: La sintassi di reStructuredText per la creazione di tabelle è disponibile negli esempi reST citati sopra.

source: semicolon
it_it: punto e virgola

source: toctree:: <=== Table of contents directive
it_it: toctree:: <=== Direttiva del sommario

source: will install all the prerequisite packages.
it_it: installerà tutti i pacchetti prerequisiti.
